{
  "name": "run_project",
  "doc": "Runs a project as a single command directly within the current Python\ninterpreter.",
  "params": [
    {
      "name": "project_directory",
      "index": 0,
      "description": "\nThe fully-qualified path to the directory where the Cauldron project is\nlocated",
      "type": "str",
      "optional": false
    },
    {
      "name": "output_directory",
      "index": 1,
      "description": "\nThe fully-qualified path to the directory where the results will be\nwritten. All of the results files will be written within this\ndirectory. If the directory does not exist, it will be created.",
      "type": "str",
      "optional": true,
      "default": "None"
    },
    {
      "name": "logging_path",
      "index": 2,
      "description": "\nThe fully-qualified path to a file that will be used for logging. If a\ndirectory is specified instead of a file, a file will be created using\nthe default filename of cauldron_run.log. If a file already exists at\nthat location it will be removed and a new file created in its place.",
      "type": "str",
      "optional": true,
      "default": "None"
    },
    {
      "name": "reader_path",
      "index": 3,
      "description": "\nSpecifies a path where a reader file will be saved after the project\nhas finished running. If no path is specified, no reader file will be\nsaved. If the path is a directory, a reader file will be saved in that\ndirectory with the project name as the file name.",
      "type": "str",
      "optional": true,
      "default": "None"
    },
    {
      "name": "reload_project_libraries",
      "index": 4,
      "description": "\nWhether or not to reload all project libraries prior to execution of\nthe project. By default this is False, but can be enabled in cases\nwhere refreshing the project libraries before execution is needed.",
      "type": "bool",
      "optional": true,
      "default": "False"
    },
    {
      "name": "forget_project",
      "index": 5,
      "description": "",
      "type": "bool",
      "optional": true,
      "default": "False"
    },
    {
      "name": "kwargs",
      "index": 6,
      "description": "\nAny variables to be available in the cauldron.shared object during\nexecution of the project can be specified here as keyword arguments.",
      "type": "Any",
      "optional": true,
      "default": "dict"
    }
  ],
  "returns": {
    "type": "ExecutionResult",
    "description": "A response object that contains information about the run process\nand the shared data from the final state of the project."
  }
}